{"source_url":"https://www.nationalsawdust.org/performances","detail_url":"https://www.nationalsawdust.org/performances","content_markdown":"[![](https://cdn.prod.website-files.com/5e9663cdcd7c08673a4b3788/5e96671be408a4055c6fc337_asset%200.png)](https://www.nationalsawdust.org/)\n  * [PERFORMANCES](https://www.nationalsawdust.org/performances)\n  * [IDEAS](https://www.nationalsawdust.org/ideas-archive)\n  * [MENTORSHIP](https://www.nationalsawdust.org/mentorship)\n  * ABOUT\n[ABOUT US](https://www.nationalsawdust.org/about)[PRESS](https://www.nationalsawdust.org/press)[TEAM](https://www.nationalsawdust.org/people)[EMPLOYMENT](https://www.nationalsawdust.org/employment)\n  * VISIT\n[PLAN YOUR VISIT](https://www.nationalsawdust.org/visit-us)[SPECIAL EVENTS](https://www.nationalsawdust.org/special-events)[DEI STATEMENT](https://www.nationalsawdust.org/DEI-statement)[HEALTH & SAFETY](https://www.nationalsawdust.org/health-safety-protocols)[SUPPORT US](https://www.nationalsawdust.org/support)\n  * [MERCH](https://national-sawdust.myshopify.com/)\n  * [GALA](https://www.nationalsawdust.org/2025gala)\n  * [DONATE / MEMBERSHIP](https://www.nationalsawdust.org/support)\n\n\n# Upcoming Performances\n[Grid View](https://www.nationalsawdust.org/performances#w-tabs-0-data-w-pane-0)[List View](https://www.nationalsawdust.org/performances#w-tabs-0-data-w-pane-1)\n[ “Slathered in reverb and sent hurtling through a dizzying maze of guitar effects, Just Mustard document succumbing to the inertia of a panic attack with a biting urgency.” Ireland’s Just Mustard return with an intimate New York show on Tuesday, September 9th at National Sawdust. September 9, 2025 - Just Mustard This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/just-mustard)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1243409)\n[ Nina Keith and Rachika Nayar were drawn to one another like mirror images or two sisters reuniting after a lifetime of separation. Four years ago, the artists met in Brooklyn's two-block–by–two-block Maria Hernandez Park after fan-girling each other’s music online. Dishing about messy post-lockdown long-distance lesbianism, heartfelt investments in Buddhist and Hindu philosophies, and a shared high-school love of the Eternal Sunshine OST, the two found their surface similarities gesturing toward a deeper shared existential worldview. Presented in partnership with AdHoc. September 12, 2025 - Rachika Nayar and Nina Keith Present Disiniblud This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/rachika-nayar-and-nina-keith-present-disiniblud)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1240898)\n[ The GRAMMY Museum is thrilled to welcome Yungblud to National Sawdust in Brooklyn, NY for a brief preview of his new documentary YUNGBLUD. ARE YOU READY, BOY, a discussion of his new album IDOLS, and a special live performance.  September 15, 2025 - The GRAMMY Museum presents A New York Evening With Yungblud This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-yungblud)\n[Buy Tickets](https://www.universe.com/events/a-new-york-evening-with-yungblud-tickets-FBJRHT)\n[ Devendra Banhart (b. 1980, Houston, Texas) lives and works in Los Angeles. An internationally renowned musician considered a pioneer of the “freak folk” and “New Weird America” movements, Banhart has toured, performed, and collaborated with Vashti Bunyan, Yoko Ono, Os Mutantes, the Swans, ANOHNI, Caetano Veloso, and Beck, amongst many others. His musical work has always existed symbiotically alongside his pursuits in the other fine arts. September 16, 2025 - Devendra Banhart (Solo) with support from Kath Bloom This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/devendra-banhart-solo-with-support-from-kath-bloom-9-16)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1242069)\n[ Devendra Banhart (b. 1980, Houston, Texas) lives and works in Los Angeles. An internationally renowned musician considered a pioneer of the “freak folk” and “New Weird America” movements, Banhart has toured, performed, and collaborated with Vashti Bunyan, Yoko Ono, Os Mutantes, the Swans, ANOHNI, Caetano Veloso, and Beck, amongst many others. His musical work has always existed symbiotically alongside his pursuits in the other fine arts. September 17, 2025 - Devendra Banhart (Solo) with support from Kath Bloom This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/devendra-banhart-solo-with-support-from-kath-bloom-9-17)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1242069)\n[ The GRAMMY Museum is thrilled to welcome Wolf Alice to National Sawdust in Brooklyn, NY for a discussion about their 4th album, The Clearing, creative process, and career with a special live performance.  September 18, 2025 - The GRAMMY Museum presents A New York Evening With Wolf Alice This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-wolf-alice)\n[Buy Tickets](https://www.universe.com/events/a-new-york-evening-with-wolf-alice-tickets-HW1DFM)\n[ When guitarist and composer Yasmin Williams sits down to compose music, she doesn’t scour her subconscious for unheard melodies or clever chord progressions. Instead, she goes granular—fixating on a single note. She’ll play it over and over, sustaining it, varying the attack or the release to change its essence, eventually adding notes to form chords. In addition to the crisp fingerpicked guitar that helped establish her as a fast-rising star of instrumental folk, Williams plays kora, harp guitar, banjo, and electric guitar and bass—all with authority. September 20, 2025 - Yasmin Williams + Special Guests This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/yasmin-williams-special-guests)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1243419)\n[ The GRAMMY Museum is thrilled to welcome rising artist Lola Young to National Sawdust in Brooklyn, NY for a discussion about her new album, I’m Only F*cking Myself, her creative process, hit single \"Messy\" and more with a special live performance.  September 23, 2025 - The GRAMMY Museum presents A New York Evening With Lola Young This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/the-grammy-museum-a-new-york-evening-with-lola-young)\n[Buy Tickets](https://www.universe.com/events/a-new-york-evening-with-lola-young-tickets-XW4QMJ)\n[ Join us on Wednesday, September 24, from 6:30 to 8:30 PM for the first one of the season, featuring Brooklyn’s very own hot sauce brand Heatonist. Enjoy a curated tasting of their signature sauces paired with a spicy cocktail crafted by our beverage director, Ricky, as we toast to bold flavors and musical innovation. Spots are limited, RSVP today to save yours! September 24, 2025 - \"Heat You Can Hear\" Community Happy Hour with Heatonist This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/heat-you-can-hear-community-happy-hour-with-heatonist)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1252009)\n[ Join cellist and composer Tamar Sagiv for the release of her debut album Shades of Mourning, —an intimate journey through grief, memory, and hope that transforms personal loss into a powerful musical expression. Drawing on her Middle Eastern heritage and rigorous classical training, Sagiv creates a sonic landscape against the backdrop of ongoing conflicts in her homeland. September 25, 2025 - Tamar Sagiv: Shades of Mourning Album Release Concert This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/tamar-sagiv-shades-of-mourning-album-release-concert)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1244460)\n[ After spending the majority of his adult life thus far in New York, Juan Wauters decides to revisit his native Montevideo, the culturally rich capital of Uruguay. Wauters explored the excitement of falling back in love with his birthplace on his subsequent record, 2023’s Wandering Rebel, but on his seventh studio album MVD LUV — due June 27 via Captured Tracks — Wauters doesn’t just introduce listeners to Montevideo; he invites them to feel at home within it. Having spent much of his career in the United States, Wauters has long carried the dual identity of immigrant and native son. With MVD LUV, a love letter to both his roots and his present, he set out to bridge those worlds by capturing the essence of Montevideo’s streets and communal spirit. September 26, 2025 - Juan Wauters This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/juan-wauters)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1237015)\n[ Zola Jesus aka Nika is an American born singer, songwriter and producer. Since 2008, she has released two EPs and seven (?) full-length albums majoratively on NY multi-decade tastemaker label Sacred Bones. Nika began training as an opera singer at the age of 10. She dismantled that training to deliver her breakthrough lo-fi record The Spoils in 2009, most of which she recorded as an undergrad in her dorm room at UW Madison. September 27, 2025 - Zola Jesus This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/zola-jesus-9-27)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1232137)\n[ Zola Jesus aka Nika is an American born singer, songwriter and producer. Since 2008, she has released two EPs and seven (?) full-length albums majoratively on NY multi-decade tastemaker label Sacred Bones. Nika began training as an opera singer at the age of 10. She dismantled that training to deliver her breakthrough lo-fi record The Spoils in 2009, most of which she recorded as an undergrad in her dorm room at UW Madison. September 27, 2025 - Zola Jesus (Late Show) This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/zola-jesus-late-show)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1232137)\n[ Moderated by Journalist Nayeema Raza // The GRAMMY Museum is thrilled to welcome award-winning string duo ARKAI to National Sawdust for their NYC album release show of Brightside (out August 22), featuring an exclusive live performance and an inside look at their music, career, and creative process. September 29, 2025 - The GRAMMY Museum presents A New York Evening with ARKAI This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-arkai)\n[Buy Tickets](https://www.universe.com/events/a-new-york-evening-with-arkai-tickets-B68HXY)\n[ New York-based singer, songwriter, and producer Elliot Moss celebrates the tenth anniversary of his seminal, career-launching record with Highspeeds (Expanded – 10th Anniversary), due August 8th via Nettwerk. The expanded edition will feature new songs left off the original album and stripped-down reworks of fan-favorites that made Elliot a cult-favorite. October 1, 2025 - Evening With Elliot Moss This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/evening-with-elliot-moss)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1237749)\n[ On the heels of her 2025 Pulitzer Prize in music, singular Filipinx-American composer, percussionist, and sound artist Susie Ibarra returns to NS+ with a program featuring U.S. and New York premieres, as well as tales of collecting sound over time in remote, rustic corners of the world.  October 7, 2025 - NationalSawdust+ presents Susie Ibarra's Parallels and Confluence: Bugang and Pasig Rivers This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/nationalsawdust-presents-susie-ibarras-parallels-and-confluence-bugang-and-pasig-rivers-alicia-hall-moran-daniel-dona-alex-peh-jake-landau-arneis-quartet)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1245642)\n[ Cuban-Chinese artist, composer, and cellist SUUVI premieres Dark Therapy—a groundbreaking neuroarts album and immersive performance—on World Mental Health Day. A classically trained prodigy who began playing cello at age two and was accepted to Juilliard at ten, SUUVI is an emerging force in experimental music. Her work merges ambient cello, spatial electronics, voice, and multilingual storytelling—infused with healing frequencies and guided by scientific insight. October 10, 2025 - SUUVI: Dark Therapy This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/suuvi-dark-therapy)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1243438)\n[ Join us for an evening with psychedelic jazz visionary Cochemea, celebrating the release of his latest album “Vol 3: Ancestros Futuros”. // Tickets on-sale Friday, August 22nd at 10am. October 11, 2025 - Cochemea - Vol 3: Ancestros Futuros LP Release Show This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/cochemea)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1250515)\n[ Ava Luna’s celebrates the release of their sixth LP. The new self-titled album is a testament to almost twenty years of shared musical sensibility, now distilled into its barest elements. The album paints an intimate, exaggerated portrait of NYC, a cacophony of jagged post-punk, funk, and dance beats giving way to lush strings and spacious minimalism. It’s a sound that is both resilient and reflective, proving that even as the city and the band evolve, Ava Luna continue to take listeners somewhere urgent and new.  October 18, 2025 - Ava Luna Album Release This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/ava-luna-album-release)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1246126)\n[ Join us for an extraordinary evening as we launch ArtSmart’s 10th Anniversary celebration with our NYC gala. This milestone event marks the beginning of our tribute to a decade of transformative music mentorship. October 20, 2025 - ArtSmart 10th Anniversary NYC Gala This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/artsmart-10th-anniversary-nyc-gala)\n[Buy Tickets](https://artsmart.org/events/nycgala/)\n[ Jog Blues brings together masters of Jazz, Blues and Indian Classical music in a 21st century mix, creating an experience drawing from deep traditions but swinging towards the future. The band is named for Jog, the Indian midnight raga, and the blues, the most American of music genres. October 23, 2025 - Jog Blues This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/jog-blues-10-23-2025)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1244462)\n[ Caroline Rose’s albums blend psychobilly, pop, shoegaze, alt-country, folk, electronic and experimental. They infuse satire, perspective-hopping, film-inspired narrative and an array of storytelling devices that transport listeners straight into Rose’s self-described “weird buffet” of a mind. October 24, 2025 - An Evening With Caroline Rose (SOLO) This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/an-evening-with-caroline-rose-solo)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1243420)\n[ The Fiery Furnaces is the long-running collaboration between siblings Eleanor and Matthew Friedberger. Renowned for their dense, allusive lyrics, formally inventive compositions, and unpredictable live shows, the band occupies a singular space in the landscape of experimental pop. October 25, 2025 - The Fiery Furnaces This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/the-fiery-furnaces)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1240437)\n[ For the longing listener… The music of composer Dan English is the communing of the head and the heart sharing secrets. The songs subsume time into feelings and images of purity, sonically and spiritually, and then, somewhat masochistically, play with lyrics drawn from the dingier parts of life: love, family, and capricious head-spaces. It’s movie-music; eternal scores for an espionage film with a protagonist who’s a clandestine, time-traveling romantic tailing the spirit itself. November 1, 2025 - Dan English with support from Superfan This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/dan-english-with-support-from-superfan)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1243415)\n[ Luna Composition Lab and ChamberQUEER present the second installment of The Nebula Project on November 3. This ongoing partnership, supported by the New York Community Trust, aims to foster emerging composers of diverse identities from Luna Composition Lab and cultivate their authentic voices through mentorship and the commissioning of new work.  November 3, 2025 - Luna Composition Lab and ChamberQUEER present The Nebula Project, Volume 2: Helix This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/luna-composition-lab-and-chamberqueer-present-the-nebula-project-volume-2-helix)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1249553)\n[ Born and raised in São Paulo, Plínio Fernandes fuses the tradition of classical guitar with Brazilian folk music. An exclusive Decca Gold recording artist, Plínio released his debut album “Saudade” in 2022, which hit Number One on the Billboard Traditional Classical Albums Chart. His second album, “Bacheando”, released in September 2023, explores Bach’s influence on Brazilian music and contrasts to his recently released EP, “Cinema”, which dives into five iconic movie soundtracks.  November 7, 2025 - Plínio Fernandes This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/plinio-fernandes)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1244435)\n[ Flock of Dimes – the solo project of multi-instrumentalist and producer Jenn Wasner – releases her third album, The Life You Save, worldwide on October 10th, 2025, on Sub Pop Records. Across the last few decades – whether it be as Flock of Dimes, as half of beloved duo Wye Oak, or via one of her many collaborations with Bon Iver, Sylvan Esso, and a sprawling list of other musical juggernauts – Wasner’s extensive catalog displays her gift for balancing authenticity and directness with an unmistakable left-of-center sensibility. Her songwriting has always found her as a keen-eyed observer, a deeply empathetic and thoughtful storyteller with a skill for probing memory, heartbreak, and unhealed trauma, a shroud of syncopation or off-kilter guitar taking a song somewhere quietly prodigious. November 8, 2025 - Flock of Dimes This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/flock-of-dimes)\n[Buy Tickets](https://ci.ovationtix.com/36490/performance/11628074)\n[ In her New York debut, Isobel Waller-Bridge presents a suite of new music. Following her performance at the inaugural Future Ruins, Trent Reznor’s new music festival in Los Angeles, she now brings this work to the stage for the first time on the East Coast. November 11, 2025 - Isobel Waller-Bridge This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/isobel-waller-bridge)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1250633)\n[ BOLDEN. is a fast-rising jazz house duo blending the soul of jazz with the rhythm of electronic music. Emerging from the UK’s vibrant underground scene, Reuben Barrett and Catherine Rannus, both gifted multi-instrumentalists with contrasting but complementary musical journeys, are forging a new path for modern jazz and electronic fusion.  November 12, 2025 - Bolden. This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/bolden)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1248167)\n[ Hannah Frances (b. 1997) is a vocalist, guitarist, composer, and poet that NPR’s Ann Powers calls “a stunning vocalist and songwriter, making monumental and mythic freak folk,” and was awarded Pitchfork’s Best New Music for her triumphant new album Keeper of the Shepherd. Through cutting lyricism and astute fingerpicked polyrhythms, Frances’ perennial sound melds avant-folk, progressive rock, and jazz. November 14, 2025 - Hannah Frances This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/hannah-frances)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1244472)\n[ Port City explores tango music throughout the genre’s history, and features bandoneon visionary Heyni Solera as soloist and composer. Palaver will perform danceable classics alongside contemporary tango-inspired compositions. November 16, 2025 - Palaver Strings: Port City ft. Heyni Solera This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/palaver-strings-port-city-ft-heyni-solera)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1244397)\n[ BlackBox Ensemble performs the U.S. premiere of PIPA BOY: Three Scenes from the Post-Diaspora by Baldwin Giang, a multimedia work for ensemble and pipa player exploring global identity and the conditions of belonging and non-belonging. The video part features collaborations with three international filmmakers. The program also includes work by Anthony Cheung, Misato Mochizuki, and Giang's song cycle butterfly, posthumously. December 5, 2025 - Scenes from the Post-Diaspora: BlackBox Ensemble performs Cheung, Mochizuki, and the US Premiere of Baldwin Giang's PIPA BOY This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/scenes-from-the-post-diaspora-blackbox-ensemble-performs-cheung-mochizuki-and-the-us-premiere-of-baldwin-giangs-pipa-boy)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1246220)\n[ “No harpist thus far has been more capable of combining all of the modern harp traditions — from Salzedo, through Dorothy Ashby, through Alice Coltrane — with such strength, grace and commitment.” - The New York Times December 13, 2025 - Brandee Younger This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/brandee-younger)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1244483)\n[ “The hyphen-rich vocalist-percussionist-speaker-producer-activist’s vibe isn’t so much “singer-songwriter” as “icon of empowerment.” Her frenetic odes to feminism, fluidity and freedom — carried off with the assistance of an entirely female or nonbinary band — mash together fragments of electro-pop, trap, Afrobeat and R&B, carried off with endless swagger.” – NPR March 20, 2026 - Madame Gandhi This is some text inside of a div block. This is some text inside of a div block. ](https://www.nationalsawdust.org/event/madame-gandhi-3-20-26)\n[Buy Tickets](https://ci.ovationtix.com/36490/production/1234690)\n#### [September 9, 2025 7:30 PM Just Mustard “Slathered in reverb and sent hurtling through a dizzying maze of guitar effects, Just Mustard document succumbing to the inertia of a panic attack with a biting urgency.” Ireland’s Just Mustard return with an intimate New York show on Tuesday, September 9th at National Sawdust. ](https://www.nationalsawdust.org/event/just-mustard)\n#### [September 12, 2025 7:30 PM Rachika Nayar and Nina Keith Present Disiniblud Nina Keith and Rachika Nayar were drawn to one another like mirror images or two sisters reuniting after a lifetime of separation. Four years ago, the artists met in Brooklyn's two-block–by–two-block Maria Hernandez Park after fan-girling each other’s music online. Dishing about messy post-lockdown long-distance lesbianism, heartfelt investments in Buddhist and Hindu philosophies, and a shared high-school love of the Eternal Sunshine OST, the two found their surface similarities gesturing toward a deeper shared existential worldview. Presented in partnership with AdHoc. ](https://www.nationalsawdust.org/event/rachika-nayar-and-nina-keith-present-disiniblud)\n#### [September 15, 2025 7:30 PM The GRAMMY Museum presents A New York Evening With Yungblud The GRAMMY Museum is thrilled to welcome Yungblud to National Sawdust in Brooklyn, NY for a brief preview of his new documentary YUNGBLUD. ARE YOU READY, BOY, a discussion of his new album IDOLS, and a special live performance.  ](https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-yungblud)\n#### [September 16, 2025 7:30 PM Devendra Banhart (Solo) with support from Kath Bloom Devendra Banhart (b. 1980, Houston, Texas) lives and works in Los Angeles. An internationally renowned musician considered a pioneer of the “freak folk” and “New Weird America” movements, Banhart has toured, performed, and collaborated with Vashti Bunyan, Yoko Ono, Os Mutantes, the Swans, ANOHNI, Caetano Veloso, and Beck, amongst many others. His musical work has always existed symbiotically alongside his pursuits in the other fine arts. ](https://www.nationalsawdust.org/event/devendra-banhart-solo-with-support-from-kath-bloom-9-16)\n#### [September 17, 2025 7:30 PM Devendra Banhart (Solo) with support from Kath Bloom Devendra Banhart (b. 1980, Houston, Texas) lives and works in Los Angeles. An internationally renowned musician considered a pioneer of the “freak folk” and “New Weird America” movements, Banhart has toured, performed, and collaborated with Vashti Bunyan, Yoko Ono, Os Mutantes, the Swans, ANOHNI, Caetano Veloso, and Beck, amongst many others. His musical work has always existed symbiotically alongside his pursuits in the other fine arts. ](https://www.nationalsawdust.org/event/devendra-banhart-solo-with-support-from-kath-bloom-9-17)\n#### [September 18, 2025 7:30 PM The GRAMMY Museum presents A New York Evening With Wolf Alice The GRAMMY Museum is thrilled to welcome Wolf Alice to National Sawdust in Brooklyn, NY for a discussion about their 4th album, The Clearing, creative process, and career with a special live performance.  ](https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-wolf-alice)\n#### [September 20, 2025 7:30 PM Yasmin Williams + Special Guests When guitarist and composer Yasmin Williams sits down to compose music, she doesn’t scour her subconscious for unheard melodies or clever chord progressions. Instead, she goes granular—fixating on a single note. She’ll play it over and over, sustaining it, varying the attack or the release to change its essence, eventually adding notes to form chords. In addition to the crisp fingerpicked guitar that helped establish her as a fast-rising star of instrumental folk, Williams plays kora, harp guitar, banjo, and electric guitar and bass—all with authority. ](https://www.nationalsawdust.org/event/yasmin-williams-special-guests)\n#### [September 23, 2025 7:30 PM The GRAMMY Museum presents A New York Evening With Lola Young The GRAMMY Museum is thrilled to welcome rising artist Lola Young to National Sawdust in Brooklyn, NY for a discussion about her new album, I’m Only F*cking Myself, her creative process, hit single \"Messy\" and more with a special live performance.  ](https://www.nationalsawdust.org/event/the-grammy-museum-a-new-york-evening-with-lola-young)\n#### [September 24, 2025 6:30 PM \"Heat You Can Hear\" Community Happy Hour with Heatonist Join us on Wednesday, September 24, from 6:30 to 8:30 PM for the first one of the season, featuring Brooklyn’s very own hot sauce brand Heatonist. Enjoy a curated tasting of their signature sauces paired with a spicy cocktail crafted by our beverage director, Ricky, as we toast to bold flavors and musical innovation. Spots are limited, RSVP today to save yours! ](https://www.nationalsawdust.org/event/heat-you-can-hear-community-happy-hour-with-heatonist)\n#### [September 25, 2025 7:30 PM Tamar Sagiv: Shades of Mourning Album Release Concert Join cellist and composer Tamar Sagiv for the release of her debut album Shades of Mourning, —an intimate journey through grief, memory, and hope that transforms personal loss into a powerful musical expression. Drawing on her Middle Eastern heritage and rigorous classical training, Sagiv creates a sonic landscape against the backdrop of ongoing conflicts in her homeland. ](https://www.nationalsawdust.org/event/tamar-sagiv-shades-of-mourning-album-release-concert)\n#### [September 26, 2025 7:30 PM Juan Wauters After spending the majority of his adult life thus far in New York, Juan Wauters decides to revisit his native Montevideo, the culturally rich capital of Uruguay. Wauters explored the excitement of falling back in love with his birthplace on his subsequent record, 2023’s Wandering Rebel, but on his seventh studio album MVD LUV — due June 27 via Captured Tracks — Wauters doesn’t just introduce listeners to Montevideo; he invites them to feel at home within it. Having spent much of his career in the United States, Wauters has long carried the dual identity of immigrant and native son. With MVD LUV, a love letter to both his roots and his present, he set out to bridge those worlds by capturing the essence of Montevideo’s streets and communal spirit. ](https://www.nationalsawdust.org/event/juan-wauters)\n#### [September 27, 2025 7:30 PM Zola Jesus Zola Jesus aka Nika is an American born singer, songwriter and producer. Since 2008, she has released two EPs and seven (?) full-length albums majoratively on NY multi-decade tastemaker label Sacred Bones. Nika began training as an opera singer at the age of 10. She dismantled that training to deliver her breakthrough lo-fi record The Spoils in 2009, most of which she recorded as an undergrad in her dorm room at UW Madison. ](https://www.nationalsawdust.org/event/zola-jesus-9-27)\n#### [September 27, 2025 10:30 PM Zola Jesus (Late Show) Zola Jesus aka Nika is an American born singer, songwriter and producer. Since 2008, she has released two EPs and seven (?) full-length albums majoratively on NY multi-decade tastemaker label Sacred Bones. Nika began training as an opera singer at the age of 10. She dismantled that training to deliver her breakthrough lo-fi record The Spoils in 2009, most of which she recorded as an undergrad in her dorm room at UW Madison. ](https://www.nationalsawdust.org/event/zola-jesus-late-show)\n#### [September 29, 2025 7:30 PM The GRAMMY Museum presents A New York Evening with ARKAI Moderated by Journalist Nayeema Raza // The GRAMMY Museum is thrilled to welcome award-winning string duo ARKAI to National Sawdust for their NYC album release show of Brightside (out August 22), featuring an exclusive live performance and an inside look at their music, career, and creative process. ](https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-arkai)\n#### [October 1, 2025 7:30 PM Evening With Elliot Moss New York-based singer, songwriter, and producer Elliot Moss celebrates the tenth anniversary of his seminal, career-launching record with Highspeeds (Expanded – 10th Anniversary), due August 8th via Nettwerk. The expanded edition will feature new songs left off the original album and stripped-down reworks of fan-favorites that made Elliot a cult-favorite. ](https://www.nationalsawdust.org/event/evening-with-elliot-moss)\n#### [October 7, 2025 7:30 PM NationalSawdust+ presents Susie Ibarra's Parallels and Confluence: Bugang and Pasig Rivers On the heels of her 2025 Pulitzer Prize in music, singular Filipinx-American composer, percussionist, and sound artist Susie Ibarra returns to NS+ with a program featuring U.S. and New York premieres, as well as tales of collecting sound over time in remote, rustic corners of the world.  ](https://www.nationalsawdust.org/event/nationalsawdust-presents-susie-ibarras-parallels-and-confluence-bugang-and-pasig-rivers-alicia-hall-moran-daniel-dona-alex-peh-jake-landau-arneis-quartet)\n#### [October 10, 2025 7:30 PM SUUVI: Dark Therapy Cuban-Chinese artist, composer, and cellist SUUVI premieres Dark Therapy—a groundbreaking neuroarts album and immersive performance—on World Mental Health Day. A classically trained prodigy who began playing cello at age two and was accepted to Juilliard at ten, SUUVI is an emerging force in experimental music. Her work merges ambient cello, spatial electronics, voice, and multilingual storytelling—infused with healing frequencies and guided by scientific insight. ](https://www.nationalsawdust.org/event/suuvi-dark-therapy)\n#### [October 11, 2025 7:30 PM Cochemea - Vol 3: Ancestros Futuros LP Release Show Join us for an evening with psychedelic jazz visionary Cochemea, celebrating the release of his latest album “Vol 3: Ancestros Futuros”. // Tickets on-sale Friday, August 22nd at 10am. ](https://www.nationalsawdust.org/event/cochemea)\n#### [October 18, 2025 7:30 PM Ava Luna Album Release Ava Luna’s celebrates the release of their sixth LP. The new self-titled album is a testament to almost twenty years of shared musical sensibility, now distilled into its barest elements. The album paints an intimate, exaggerated portrait of NYC, a cacophony of jagged post-punk, funk, and dance beats giving way to lush strings and spacious minimalism. It’s a sound that is both resilient and reflective, proving that even as the city and the band evolve, Ava Luna continue to take listeners somewhere urgent and new.  ](https://www.nationalsawdust.org/event/ava-luna-album-release)\n#### [October 20, 2025 5:30 PM ArtSmart 10th Anniversary NYC Gala Join us for an extraordinary evening as we launch ArtSmart’s 10th Anniversary celebration with our NYC gala. This milestone event marks the beginning of our tribute to a decade of transformative music mentorship. ](https://www.nationalsawdust.org/event/artsmart-10th-anniversary-nyc-gala)\n#### [October 23, 2025 7:30 PM Jog Blues Jog Blues brings together masters of Jazz, Blues and Indian Classical music in a 21st century mix, creating an experience drawing from deep traditions but swinging towards the future. The band is named for Jog, the Indian midnight raga, and the blues, the most American of music genres. ](https://www.nationalsawdust.org/event/jog-blues-10-23-2025)\n#### [October 24, 2025 7:30 PM An Evening With Caroline Rose (SOLO) Caroline Rose’s albums blend psychobilly, pop, shoegaze, alt-country, folk, electronic and experimental. They infuse satire, perspective-hopping, film-inspired narrative and an array of storytelling devices that transport listeners straight into Rose’s self-described “weird buffet” of a mind. ](https://www.nationalsawdust.org/event/an-evening-with-caroline-rose-solo)\n#### [October 25, 2025 7:30 PM The Fiery Furnaces The Fiery Furnaces is the long-running collaboration between siblings Eleanor and Matthew Friedberger. Renowned for their dense, allusive lyrics, formally inventive compositions, and unpredictable live shows, the band occupies a singular space in the landscape of experimental pop. ](https://www.nationalsawdust.org/event/the-fiery-furnaces)\n#### [November 1, 2025 7:30 PM Dan English with support from Superfan For the longing listener… The music of composer Dan English is the communing of the head and the heart sharing secrets. The songs subsume time into feelings and images of purity, sonically and spiritually, and then, somewhat masochistically, play with lyrics drawn from the dingier parts of life: love, family, and capricious head-spaces. It’s movie-music; eternal scores for an espionage film with a protagonist who’s a clandestine, time-traveling romantic tailing the spirit itself. ](https://www.nationalsawdust.org/event/dan-english-with-support-from-superfan)\n#### [November 3, 2025 7:00 PM Luna Composition Lab and ChamberQUEER present The Nebula Project, Volume 2: Helix Luna Composition Lab and ChamberQUEER present the second installment of The Nebula Project on November 3. This ongoing partnership, supported by the New York Community Trust, aims to foster emerging composers of diverse identities from Luna Composition Lab and cultivate their authentic voices through mentorship and the commissioning of new work.  ](https://www.nationalsawdust.org/event/luna-composition-lab-and-chamberqueer-present-the-nebula-project-volume-2-helix)\n#### [November 7, 2025 7:30 PM Plínio Fernandes Born and raised in São Paulo, Plínio Fernandes fuses the tradition of classical guitar with Brazilian folk music. An exclusive Decca Gold recording artist, Plínio released his debut album “Saudade” in 2022, which hit Number One on the Billboard Traditional Classical Albums Chart. His second album, “Bacheando”, released in September 2023, explores Bach’s influence on Brazilian music and contrasts to his recently released EP, “Cinema”, which dives into five iconic movie soundtracks.  ](https://www.nationalsawdust.org/event/plinio-fernandes)\n#### [November 8, 2025 8:00 PM Flock of Dimes Flock of Dimes – the solo project of multi-instrumentalist and producer Jenn Wasner – releases her third album, The Life You Save, worldwide on October 10th, 2025, on Sub Pop Records. Across the last few decades – whether it be as Flock of Dimes, as half of beloved duo Wye Oak, or via one of her many collaborations with Bon Iver, Sylvan Esso, and a sprawling list of other musical juggernauts – Wasner’s extensive catalog displays her gift for balancing authenticity and directness with an unmistakable left-of-center sensibility. Her songwriting has always found her as a keen-eyed observer, a deeply empathetic and thoughtful storyteller with a skill for probing memory, heartbreak, and unhealed trauma, a shroud of syncopation or off-kilter guitar taking a song somewhere quietly prodigious. ](https://www.nationalsawdust.org/event/flock-of-dimes)\n#### [November 11, 2025 7:30 PM Isobel Waller-Bridge In her New York debut, Isobel Waller-Bridge presents a suite of new music. Following her performance at the inaugural Future Ruins, Trent Reznor’s new music festival in Los Angeles, she now brings this work to the stage for the first time on the East Coast. ](https://www.nationalsawdust.org/event/isobel-waller-bridge)\n#### [November 12, 2025 7:30 PM Bolden. BOLDEN. is a fast-rising jazz house duo blending the soul of jazz with the rhythm of electronic music. Emerging from the UK’s vibrant underground scene, Reuben Barrett and Catherine Rannus, both gifted multi-instrumentalists with contrasting but complementary musical journeys, are forging a new path for modern jazz and electronic fusion.  ](https://www.nationalsawdust.org/event/bolden)\n#### [November 14, 2025 7:30 PM Hannah Frances Hannah Frances (b. 1997) is a vocalist, guitarist, composer, and poet that NPR’s Ann Powers calls “a stunning vocalist and songwriter, making monumental and mythic freak folk,” and was awarded Pitchfork’s Best New Music for her triumphant new album Keeper of the Shepherd. Through cutting lyricism and astute fingerpicked polyrhythms, Frances’ perennial sound melds avant-folk, progressive rock, and jazz. ](https://www.nationalsawdust.org/event/hannah-frances)\n#### [November 16, 2025 7:00 PM Palaver Strings: Port City ft. Heyni Solera Port City explores tango music throughout the genre’s history, and features bandoneon visionary Heyni Solera as soloist and composer. Palaver will perform danceable classics alongside contemporary tango-inspired compositions. ](https://www.nationalsawdust.org/event/palaver-strings-port-city-ft-heyni-solera)\n#### [December 5, 2025 7:30 PM Scenes from the Post-Diaspora: BlackBox Ensemble performs Cheung, Mochizuki, and the US Premiere of Baldwin Giang's PIPA BOY BlackBox Ensemble performs the U.S. premiere of PIPA BOY: Three Scenes from the Post-Diaspora by Baldwin Giang, a multimedia work for ensemble and pipa player exploring global identity and the conditions of belonging and non-belonging. The video part features collaborations with three international filmmakers. The program also includes work by Anthony Cheung, Misato Mochizuki, and Giang's song cycle butterfly, posthumously. ](https://www.nationalsawdust.org/event/scenes-from-the-post-diaspora-blackbox-ensemble-performs-cheung-mochizuki-and-the-us-premiere-of-baldwin-giangs-pipa-boy)\n#### [December 13, 2025 7:30 PM Brandee Younger “No harpist thus far has been more capable of combining all of the modern harp traditions — from Salzedo, through Dorothy Ashby, through Alice Coltrane — with such strength, grace and commitment.” - The New York Times ](https://www.nationalsawdust.org/event/brandee-younger)\n#### [March 20, 2026 7:30 PM Madame Gandhi “The hyphen-rich vocalist-percussionist-speaker-producer-activist’s vibe isn’t so much “singer-songwriter” as “icon of empowerment.” Her frenetic odes to feminism, fluidity and freedom — carried off with the assistance of an entirely female or nonbinary band — mash together fragments of electro-pop, trap, Afrobeat and R&B, carried off with endless swagger.” – NPR ](https://www.nationalsawdust.org/event/madame-gandhi-3-20-26)\n# contemplations\n## Contemplations is a celebration of National Sawdust's work from inception through the 6th season in 2020-21, and a tribute to all the artists, collaborators, funders, and friends who have made it possible. A special thanks to the National Sawdust board and team who collectively help us make our dreams into reality.\n## This book features the photographic work of Jill Steinberg, with curation and story by Paola Prestini. It is a companion project to the television and video broadcast series of the same name developed in partnership with The WNET Group's ALL ARTS platforms featuring highlights of National Sawdust's work in the world.\n## [Learn more about Contemplations here.](https://ci.ovationtix.com/36490/store/products/83395)\n‍\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/63546d7b6e708abd3b5c2c30_Ryuichi%20Sakamoto%20with%20Taylor%20Deupree%2C%20Joseph%20Branciforte%2C%20and%20Theo%20Bleckmann%20_0108_.jpg)](https://www.nationalsawdust.org/performances)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/63546d7b4f3fdf4713087c0d_An%20Evening%20Honoring%20Jessye%20Norman_0862_.jpg)](https://www.nationalsawdust.org/performances)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/63546d7cdb028ee22788d19e_FlexN_0985_.jpg)](https://www.nationalsawdust.org/performances)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/63546d7b4d0d417c349adec7_NS%2B%20Talks-%20Yo%20Yo%20Ma%20and%20Maria%20Popova__0056_.jpg)](https://www.nationalsawdust.org/performances)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/63546d7b4d0d4167019adec6_NY%20Phil%20Biennial%20%20Shared%20Madness%20Jenny%20Koh_0063_.jpg)](https://www.nationalsawdust.org/performances)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/63546d7bd7135d758af5b9a4_OMW%20Cornelius%20Dufallo_0051_.jpg)](https://www.nationalsawdust.org/performances)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/63546d7b2cf2501536639421_Orphic%20Moments_0794_-5.jpg)](https://www.nationalsawdust.org/performances)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/63546d7c5f0aee15b42f7eda_pg%20172-173%20%20CIMAFUNK_0300_v2.jpg)](https://www.nationalsawdust.org/performances)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/63546d7b256a8d854f5e0db5_pg%20230-231%20Huang%20Ruo_s%20The%20Sonic%20Great%20Wall__0495_v2.jpg)](https://www.nationalsawdust.org/performances)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/63546d7cafc1666f0bf98f65_pg%20235%20Laraaji%20Presents-%20%20_Sun%20Piano__0140_2v.jpg)](https://www.nationalsawdust.org/performances)\n# Past Events\n[VIEW ALL Events](https://www.nationalsawdust.org/past-events)\n[**  \n  \nREVIEW OUR IN-VENUE COVID PROTOCOLS**](https://www.nationalsawdust.org/health-safety-protocols)\n[**National Sawdust DEI/Anti-Racism Commitment  \n  \n‍**](https://www.nationalsawdust.org/DEI-statement)[**National Sawdust Code of Ethics**](https://nationalsawdust.org/code-of-ethics)\nContact\n(646) - 779 - 8455  \n80 North 6th St  \nBrooklyn, NY 11249  \n  \ninfo@nationalsawdust.org\nFOLLOW US\n[](https://www.facebook.com/NationalSawdust/)[](https://www.instagram.com/nationalsawdust/)[](https://twitter.com/nationalsawdust)[](https://vimeo.com/nationalsawdust/)\n[](https://www.nationalsawdust.org/bloomberg-connects)\n_  \n  \n‍_  \n\nCopyright 2022","extraction":{"title":"Ireland’s Just Mustard return with an intimate New York show","start_date":"2025-09-09","end_date":"2025-09-09","start_time":"19:00","end_time":null,"timezone":null,"location_address":"National Sawdust, Brooklyn, NY","image_url":"https://cdn.prod.website-files.com/5e9663cdcd7c08673a4b3788/5e96671be408a4055c6fc337_asset%200.png","description":"Slathered in reverb and sent hurtling through a dizzying maze of guitar effects, Just Mustard document succumbing to the inertia of a panic attack with a biting urgency.","source_url":"https://www.nationalsawdust.org/","detail_url":"https://www.nationalsawdust.org/event/just-mustard"}}
{"source_url":"https://www.nationalsawdust.org/performances","detail_url":"https://www.nationalsawdust.org/special-events","content_markdown":"[![](https://cdn.prod.website-files.com/5e9663cdcd7c08673a4b3788/5e96671be408a4055c6fc337_asset%200.png)](https://www.nationalsawdust.org/)\n  * [PERFORMANCES](https://www.nationalsawdust.org/performances)\n  * [IDEAS](https://www.nationalsawdust.org/ideas-archive)\n  * [MENTORSHIP](https://www.nationalsawdust.org/mentorship)\n  * ABOUT\n[ABOUT US](https://www.nationalsawdust.org/about)[PRESS](https://www.nationalsawdust.org/press)[TEAM](https://www.nationalsawdust.org/people)[EMPLOYMENT](https://www.nationalsawdust.org/employment)\n  * VISIT\n[PLAN YOUR VISIT](https://www.nationalsawdust.org/visit-us)[SPECIAL EVENTS](https://www.nationalsawdust.org/special-events)[DEI STATEMENT](https://www.nationalsawdust.org/DEI-statement)[HEALTH & SAFETY](https://www.nationalsawdust.org/health-safety-protocols)[SUPPORT US](https://www.nationalsawdust.org/support)\n  * [MERCH](https://national-sawdust.myshopify.com/)\n  * [GALA](https://www.nationalsawdust.org/2025gala)\n  * [DONATE / MEMBERSHIP](https://www.nationalsawdust.org/support)\n\n\nArtistic expression empowers us all to create a more just and joyful world.\nHelp us produce and curate transformative artistic collaborations through our digital stage and state-of-the-art venue in Brooklyn, NY.\nIn celebration of our current campaign Contemplations from National Sawdust, your gift will be matched dollar-for-dollar through June 30th.\n[Donate today](https://nationalsawdust.org/support)\n# SPECIAL EVENTS\n[CLIENT PARTNERS](https://www.nationalsawdust.org/special-events#client-partners)[PHOTO GALLERY](https://www.nationalsawdust.org/special-events#photo-gallery)[DOWNLOADS](https://www.nationalsawdust.org/special-events#downloads)\nNational Sawdust works with leading brands and partners to create world-class bespoke experiences and events presented in our venue, on our digital stage, and live-streamed.   \n\nWhether a private concert, seated dinner and performance, conference, or reception; the National Sawdust team will work with you to create a memorable and impactful event that leverages our creative and musical expertise and our state-of-the-art venue technology featuring Meyer Sound’s Constellation system.  \n\n[CLIENT PARTNERS](https://www.nationalsawdust.org/performances-prev)[PHOTO GALLERY](https://www.nationalsawdust.org/ideas-archive)[DOWNLOADS](https://nationalsawdust.org/about-2-2/)\nJust Mustard\n# CLIENT\n# PARTNERS\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fec52cf39741365e4c8a_tumblr_logo_3.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6feb52cf39769f25e4c58_spotifiy-logo.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fea9ab61357fd9208cc8_sony%20logo.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fe98a26fe34974abbb7c_samsung%20logo.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fe881cbbc739e838c771_rolling-stone-magazine-logo-symbol-trademark-word-transparent-png-2215782.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fe7e72181eb71eb7f56e_rolex-logo.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fe6d559876b2ea11ce6c_pwc-logo.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fe5dab613542e8208874_pitchforklogo-freelogovectors.net_-400x400.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fe2ee1a61c4531fc8573_pepsico_logo_freelogovectors.net_.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fe240f9b3a3a658078ed_Nike.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fe142736d1faacb2a104_make-up-for-ever-logo-AD3BB24D0C-seeklogo.com.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fe08a26fe37e4babb1a7_hermes-logo.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fdfaab61351dff2081bb_hbo-logo%20\\(1\\).png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fdeed40fd8596d3b19ca_Brooklyn_Nets-logo.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fde30f9b3aeb198075cc_billboard-logo-billboard-charts-text-number-symbol-alphabet-transparent-png-780669.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fdd85d99649d95f26b03_att-t-new-logo.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fdca72181e5ed0b7ed89_arc_teryx%20logo.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fdbfd40fd892db3b18c5_amazon%20studio%20logo.png)\n![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e6fdb169c3f3fb51c339e7_adidas-logo.png)\n### National Sawdust & LVMH/Fresh skin care company\nAt National Sawdust, we believe that artistic expression empowers us all to create a more joyful and just world.National Sawdust’s mission is rooted in music discovery that is open, inclusive, and based in active mentorship of emerging artists, while building new audiences and communities of music devotees.National Sawdust engages artists in an ecosystem of incubation to dissemination, programming groundbreaking new music in our state-of-the-art Williamsburg venue, and developing and touring new, collaborative music-driven projects — the National Sawdust DNA produces and presents world-class artistic work which embraces a wide stylistic approach to music.\nNational Sawdust believes in being an innovative leader in changing the landscape of contemporary music, by bringing all voices to the stage and beyond — artistic representation that reflects the ever-evolving multicultural society in which we live.\n“As a composer, I believe the role of an artist in the 21st century is that of creator, educator, activist, and entrepreneur. At National Sawdust, supporting emerging artists is our core mission, nurturing a wide array of voices who are collectively reshaping the landscape of new music for this new century. The work we champion and help support speaks to the National Sawdust DNA: empowering high-level artistry, regardless of genre, by multicultural artists who tell their stories through their music.”\n– Paola Prestini, Composer, Co-Founder and Artistic Director\n[VIEW ALL UPCOMING](https://www.nationalsawdust.org/performances-prev)\n# EVENT\n# PHOTO GALLERY\n[VIEW MORE](https://www.nationalsawdust.org/ideas-archive)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7e19d93f3fb8e9a9122e4_13_NS_Chloe%20Flower%20_%20Krug%20copy.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7e179f7d0d576cce65d32_12_NS_Avon2%20\\(1\\)%20copy.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7e15fb42fd533f5f393b0_11_NS_Avon1%20\\(1\\)%20copy.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7e1297abecc835f88c54d_10_NationalSawdustJune7th2022126%20copy.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7e11f6302b9e86161f68a_09_IMG_2800%20copy.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7e0e7f01eb93d1330d490_08_euphoria%20copy.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7df4bfda79ed08a28da8d_07_EPICURIAN-NIGHTS-20181105-5472-1030x687.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7df16d9a6cb7b2fcbd982_06_DgUJ4vAU8AIpzcS.jpg-large%20copy.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7decf7374df45ec485f49_05_Billboard%202%20copy.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7de6cb42fd50b1af3660b_04_Billboard%201%20copy.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7de3e0374f0f598bfebf8_03_Arc_teryx%20copy.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7de047abeccd45788a649_02_Adidas%20copy.jpg)](https://www.nationalsawdust.org/special-events)\n[![](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e7ddee145d7332714db7a0_01_38465797791_a1bb952254_h.jpg)](https://www.nationalsawdust.org/special-events)\n# DOWNLOADS\n##### Projection Mapping Info\n##### [DOWNLOAD](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e8624318b94848b7b0acd6_4.NS%20Tech%20Projection%20Info%20Deck.pdf)\n##### Floor Plan\n##### [DOWNLOAD](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e8620e273b5c69bd739fdf_3.NS%20Floor%20Plan%20Main%20Hall.png)\n##### Tech Specs & Meyer Sound System Profile\n##### [DOWNLOAD](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/62e861dfb58df9053d904be4_2.NS%20Tech%20Specs%20-%20%20private%20events.pdf)\n##### Special Events Deck\n##### [DOWNLOAD](https://cdn.prod.website-files.com/5ea4ada849d1a708b00fb8b1/6838787975e266e54d649086_NS%20Events%20Deck.pdf)\n[**  \n  \nREVIEW OUR IN-VENUE COVID PROTOCOLS**](https://www.nationalsawdust.org/health-safety-protocols)\n[**National Sawdust DEI/Anti-Racism Commitment  \n  \n‍**](https://www.nationalsawdust.org/DEI-statement)[**National Sawdust Code of Ethics**](https://nationalsawdust.org/code-of-ethics)\nContact\n(646) - 779 - 8455  \n80 North 6th St  \nBrooklyn, NY 11249  \n  \ninfo@nationalsawdust.org\nFOLLOW US\n[](https://www.facebook.com/NationalSawdust/)[](https://www.instagram.com/nationalsawdust/)[](https://twitter.com/nationalsawdust)[](https://vimeo.com/nationalsawdust/)\n[](https://www.nationalsawdust.org/bloomberg-connects)\n_  \n  \n‍_  \n\nCopyright 2022","extraction":{"title":null,"start_date":null,"end_date":null,"start_time":null,"end_time":null,"timezone":null,"location_address":null,"image_url":"https://cdn.prod.website-files.com/5e9663cdcd7c08673a4b3788/5e96671be408a4055c6fc337_asset%200.png","description":null,"source_url":"https://www.nationalsawdust.org/performances","detail_url":"https://www.nationalsawdust.org/special-events"}}
{"source_url":"https://www.nationalsawdust.org/performances","detail_url":"https://www.nationalsawdust.org/event/just-mustard","content_markdown":"[![](https://cdn.prod.website-files.com/5e9663cdcd7c08673a4b3788/5e96671be408a4055c6fc337_asset%200.png)](https://www.nationalsawdust.org/)\n  * [PERFORMANCES](https://www.nationalsawdust.org/performances)\n  * [IDEAS](https://www.nationalsawdust.org/ideas-archive)\n  * [MENTORSHIP](https://www.nationalsawdust.org/mentorship)\n  * ABOUT\n[ABOUT US](https://www.nationalsawdust.org/about)[PRESS](https://www.nationalsawdust.org/press)[TEAM](https://www.nationalsawdust.org/people)[EMPLOYMENT](https://www.nationalsawdust.org/employment)\n  * VISIT\n[PLAN YOUR VISIT](https://www.nationalsawdust.org/visit-us)[SPECIAL EVENTS](https://www.nationalsawdust.org/special-events)[DEI STATEMENT](https://www.nationalsawdust.org/DEI-statement)[HEALTH & SAFETY](https://www.nationalsawdust.org/health-safety-protocols)[SUPPORT US](https://www.nationalsawdust.org/support)\n  * [MERCH](https://national-sawdust.myshopify.com/)\n  * [GALA](https://www.nationalsawdust.org/2025gala)\n  * [DONATE / MEMBERSHIP](https://www.nationalsawdust.org/support)\n\n\n# Just Mustard\n[](https://www.nationalsawdust.org/event/just-mustard#redesign)\n[Performances](https://www.nationalsawdust.org/performances-prev)[HOME](https://www.nationalsawdust.org/event/just-mustard#home)[IDEAS](https://www.nationalsawdust.org/event/just-mustard)\n“Slathered in reverb and sent hurtling through a dizzying maze of guitar effects, Just Mustard document succumbing to the inertia of a panic attack with a biting urgency.” Ireland’s Just Mustard return with an intimate New York show on Tuesday, September 9th at National Sawdust.\nLIVE AT NATIONAL SAWDUST // DOORS AT 6:30PM\nSeptember 9, 2025\n7:30 pm\n[BUY TICKETS](https://ci.ovationtix.com/36490/production/1243409)\nThis event has passed\n## What’s a Rich Text element?\nThe rich text element allows you to create and format headings, paragraphs, blockquotes, images, and video all in one place instead of having to add and format them individually. Just double-click and easily create content.\n#### Static and dynamic content editing\nA rich text element can be used with static or dynamic content. For static content, just drop it into any page and begin editing. For dynamic content, add a rich text field to any collection and then connect a rich text element to that field in the settings panel. [Voila!](http://google.com)\n#### How to customize formatting for each rich text\nHeadings, paragraphs, blockquotes, figures, images, and figure captions can all be styled after a class is added to the rich text element using the \"When inside of\" nested selector system.\nJust Mustard is **Katie Ball** , **David Noonan** , **Mete Kalyon** , **Rob Clarke** , and **Shane Maguire**. _Heart Under_ earned Just Mustard widespread acclaim, with the band racking up rave reviews from _NME_ ,_The Telegraph_ , _Pitchfork_ , _DIY_ , _The Independent_ , and plenty more. Their music has been championed by _BBC 6 Music, BBC Radio 1, KEXP,_ as well as The Cure, Depeche Mode and Fontaines D.C., all of whom they’ve supported on tour.\n# Sep 9\n# Just Mustard\n# UPCOMING\n##### [Sep 12 Rachika Nayar and Nina Keith Present Disiniblud ](https://www.nationalsawdust.org/event/rachika-nayar-and-nina-keith-present-disiniblud)\n##### [Sep 15 The GRAMMY Museum presents A New York Evening With Yungblud ](https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-yungblud)\n##### [Sep 16 Devendra Banhart (Solo) with support from Kath Bloom ](https://www.nationalsawdust.org/event/devendra-banhart-solo-with-support-from-kath-bloom-9-16)\n[**  \n  \nREVIEW OUR IN-VENUE COVID PROTOCOLS**](https://www.nationalsawdust.org/health-safety-protocols)\n[**National Sawdust DEI/Anti-Racism Commitment  \n  \n‍**](https://www.nationalsawdust.org/DEI-statement)[**National Sawdust Code of Ethics**](https://nationalsawdust.org/code-of-ethics)\nContact\n(646) - 779 - 8455  \n80 North 6th St  \nBrooklyn, NY 11249  \n  \ninfo@nationalsawdust.org\nFOLLOW US\n[](https://www.facebook.com/NationalSawdust/)[](https://www.instagram.com/nationalsawdust/)[](https://twitter.com/nationalsawdust)[](https://vimeo.com/nationalsawdust/)\n[](https://www.nationalsawdust.org/bloomberg-connects)\n_  \n  \n‍_  \n\nCopyright 2022","extraction":{"title":"Just Mustard","start_date":"2025-09-09","end_date":"2025-09-09","start_time":"19:30","end_time":null,"timezone":null,"location_address":"80 North 6th St, Brooklyn, NY","image_url":"https://cdn.prod.website-files.com/5e9663cdcd7c08673a4b3788/5e96671be408a4055c6fc337_asset%200.png","description":"Ireland’s Just Mustard return with an intimate New York show on Tuesday, September 9th at National Sawdust.","source_url":"https://www.nationalsawdust.org/performances","detail_url":"https://www.nationalsawdust.org/event/just-mustard"}}
{"source_url":"https://www.nationalsawdust.org/performances","detail_url":"https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-yungblud","content_markdown":"[![](https://cdn.prod.website-files.com/5e9663cdcd7c08673a4b3788/5e96671be408a4055c6fc337_asset%200.png)](https://www.nationalsawdust.org/)\n  * [PERFORMANCES](https://www.nationalsawdust.org/performances)\n  * [IDEAS](https://www.nationalsawdust.org/ideas-archive)\n  * [MENTORSHIP](https://www.nationalsawdust.org/mentorship)\n  * ABOUT\n[ABOUT US](https://www.nationalsawdust.org/about)[PRESS](https://www.nationalsawdust.org/press)[TEAM](https://www.nationalsawdust.org/people)[EMPLOYMENT](https://www.nationalsawdust.org/employment)\n  * VISIT\n[PLAN YOUR VISIT](https://www.nationalsawdust.org/visit-us)[SPECIAL EVENTS](https://www.nationalsawdust.org/special-events)[DEI STATEMENT](https://www.nationalsawdust.org/DEI-statement)[HEALTH & SAFETY](https://www.nationalsawdust.org/health-safety-protocols)[SUPPORT US](https://www.nationalsawdust.org/support)\n  * [MERCH](https://national-sawdust.myshopify.com/)\n  * [GALA](https://www.nationalsawdust.org/2025gala)\n  * [DONATE / MEMBERSHIP](https://www.nationalsawdust.org/support)\n\n\n# The GRAMMY Museum presents A New York Evening With Yungblud\n[](https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-yungblud#redesign)\n[Performances](https://www.nationalsawdust.org/performances-prev)[HOME](https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-yungblud#home)[IDEAS](https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-yungblud)\nThe GRAMMY Museum is thrilled to welcome Yungblud to National Sawdust in Brooklyn, NY for a brief preview of his new documentary YUNGBLUD. ARE YOU READY, BOY, a discussion of his new album IDOLS, and a special live performance. \nLIVE AT NATIONAL SAWDUST // DOORS AT 6:30PM\nSeptember 15, 2025\n7:30 pm\n[BUY TICKETS](https://www.universe.com/events/a-new-york-evening-with-yungblud-tickets-FBJRHT)\nThis event has passed\n## What’s a Rich Text element?\nThe rich text element allows you to create and format headings, paragraphs, blockquotes, images, and video all in one place instead of having to add and format them individually. Just double-click and easily create content.\n#### Static and dynamic content editing\nA rich text element can be used with static or dynamic content. For static content, just drop it into any page and begin editing. For dynamic content, add a rich text field to any collection and then connect a rich text element to that field in the settings panel. [Voila!](http://google.com)\n#### How to customize formatting for each rich text\nHeadings, paragraphs, blockquotes, figures, images, and figure captions can all be styled after a class is added to the rich text element using the \"When inside of\" nested selector system.\nYungblud is one of the many artists to be featured in the GRAMMY Museum’s New York City program series, which includes bringing a slate of the GRAMMY Museum’s renowned GRAMMY In The Schools Education Programs and Public Programs to the East Coast. “A New York Evening With…” is generously supported by the Dawn and Brian Hoesterey Family Foundation.\n* * *\n**This is a seated performance. Have a question about this performance? Please email****guestservices@grammymuseum.org****.**\n**ABOUT YUNGBLUD**\nYungblud AKA Dominic Harrison is the 27-year-old from Doncaster who has achieved two UK number-one albums, generated six billion Spotify streams globally, and broken into the Billboard Top 100 with his last two albums.\nIn 2024, Yungblud debuted his own festival, Bludfest, at The National Bowl in Milton Keynes, where he presented a curated lineup of artists, headlining the bill himself. That same year, he released You Need to Exist: A Book to Love and Destroy on Penguin Publishing, which became an instant No.1 Sunday Times Bestseller.\nThis summer, Yungblud will release his fourth studio album, _IDOLS_.\nOn **_IDOLS,_ Yungblud **explores the theme of hero-worship; how we look to others for validation, often putting others’ lives on a pedestal at the expense of the richness of our own experiences. **Yungblud** says, “ _We turn to others for an identity before turning to ourselves. Self-belief, self-reclamation, self-evolution and change. As we grow up, we lose our belief in magic and mystery. We begin to rationalize everything; our cage walls build up._ ” He added, “ _We compare ourselves to 15 different people before we’ve even had our breakfast_ ”.**‍**\n‍**  \nABOUT _YUNGBLUD. ARE YOU READY, BOY?_**\nThe feature-length documentary, directed by three-time**Grammy Award-nominated** ,**Emmy®** and **BAFTA-** winning filmmaker**Paul Dugdale** (_Adele: One Night Only_ , _Elton John Live: Farewell From Dodger Stadium_ , _The Prodigy 'Worlds on Fire’_ , _Glastonbury Festival: Live at Worthy Farm_) was shot at the legendary **Hansa Studios Building** in **Berlin** , the birthplace of **David Bowie** ’s **_Heroes,_** **U2’s _Achtung Baby!_** and countless other iconic albums.\nA personal journey of change, confidence and rock-and-roll chaos, set against a city that has always celebrated counterculture and creativity, **_YUNGBLUD. ARE YOU READY, BOY?_** is a revealing and uncompromising documentary about a generational artist finding his own voice.\nPresented in B&W and colour, including stunning sequences shot in 16mm, the two-hour-long documentary shows **Yungblud** at a pivotal moment in his career. The film follows the artist as he relocates to the historic Berlin studio with his band to record live performances of tracks from his brand-new album, **_Idols_** , for the very first time. His most personal record to date, **_Idols_** was released in June 2025 to critical acclaim, becoming **Yungblud’s** third consecutive no. 1 album in the UK. With cameras rolling throughout the entire process and no live audience present, the project removes any artifice, presenting a truthful and unapologetic behind-the-scenes look at the creative process and the performances in its purest form, highlighting the intimate relationships and dynamic between Dom, the band and the music.\n# Sep 15\n# The GRAMMY Museum presents A New York Evening With Yungblud\n# UPCOMING\n##### [Sep 9 Just Mustard ](https://www.nationalsawdust.org/event/just-mustard)\n##### [Sep 12 Rachika Nayar and Nina Keith Present Disiniblud ](https://www.nationalsawdust.org/event/rachika-nayar-and-nina-keith-present-disiniblud)\n##### [Sep 16 Devendra Banhart (Solo) with support from Kath Bloom ](https://www.nationalsawdust.org/event/devendra-banhart-solo-with-support-from-kath-bloom-9-16)\n[**  \n  \nREVIEW OUR IN-VENUE COVID PROTOCOLS**](https://www.nationalsawdust.org/health-safety-protocols)\n[**National Sawdust DEI/Anti-Racism Commitment  \n  \n‍**](https://www.nationalsawdust.org/DEI-statement)[**National Sawdust Code of Ethics**](https://nationalsawdust.org/code-of-ethics)\nContact\n(646) - 779 - 8455  \n80 North 6th St  \nBrooklyn, NY 11249  \n  \ninfo@nationalsawdust.org\nFOLLOW US\n[](https://www.facebook.com/NationalSawdust/)[](https://www.instagram.com/nationalsawdust/)[](https://twitter.com/nationalsawdust)[](https://vimeo.com/nationalsawdust/)\n[](https://www.nationalsawdust.org/bloomberg-connects)\n_  \n  \n‍_  \n\nCopyright 2022","extraction":{"title":"The GRAMMY Museum presents A New York Evening With Yungblud","start_date":"2025-09-15","end_date":"2025-09-15","start_time":"19:30","end_time":null,"timezone":null,"location_address":"80 North 6th St, Brooklyn, NY 11249","image_url":"https://cdn.prod.website-files.com/5e9663cdcd7c08673a4b3788/5e96671be408a4055c6fc337_asset%200.png","description":"Yungblud to perform at National Sawdust in Brooklyn, NY for a special live performance.","source_url":"https://www.nationalsawdust.org/performances","detail_url":"https://www.nationalsawdust.org/event/the-grammy-museum-presents-a-new-york-evening-with-yungblud"}}
